app/Controllers/API/V1/Auth.php

        ];

        try {
            $userId = $this->userModel->insert($data);
---
INSERT INTO `users` (`name`, `email`, `phone`, `password`, `role`, `created_at`, `updated_at`) VALUES ('aiman', 'aiman@gmail.com', '080808080808', '$2y$12$hzna4gn.PK329cqJmdU6GeisGvuKR6Z4bsZC/a86q4zzrpNmDQxhG', 'user', '2025-11-30 15:00:13', '2025-11-30 15:00:13')

            }

            // Get user data without password
            $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 2