app/Controllers/API/V1/Booking.php


        try {
            // Check ticket availability
            $ticket = $this->ticketTypeModel->find($ticketTypeId);
---
SELECT *
FROM `ticket_types`
WHERE `ticket_types`.`id` = 2