app/Controllers/API/V1/Tickets.php

    public function index()
    {
        try {
            $tickets = $this->ticketTypeModel->findAll();
---
SELECT *
FROM `ticket_types`