app/Controllers/API/V1/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `bookings`
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `payment_status` = 'pending'
SELECT SUM(`total_price`) AS `total_price`
FROM `bookings`
WHERE `payment_status` = 'confirmed'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'
SELECT `ticket_types`.`name`, COUNT(bookings.id) as total_bookings, SUM(bookings.quantity) as total_tickets, SUM(bookings.total_price) as revenue
FROM `bookings`
JOIN `ticket_types` ON `ticket_types`.`id` = `bookings`.`ticket_type_id`
WHERE `bookings`.`payment_status` = 'confirmed'
GROUP BY `bookings`.`ticket_type_id`
SELECT `bookings`.*, `users`.`name` as `user_name`, `ticket_types`.`name` as `ticket_name`
FROM `bookings`
JOIN `users` ON `users`.`id` = `bookings`.`user_id`
JOIN `ticket_types` ON `ticket_types`.`id` = `bookings`.`ticket_type_id`
ORDER BY `bookings`.`created_at` DESC
 LIMIT 5
---
    public function stats()
    {
        try {
            // Total bookings
            $totalBookings = $this->bookingModel->countAll();

            // Pending payments count
            $pendingPayments = $this->bookingModel->where('payment_status', 'pending')->countAllResults();

            // Total revenue (confirmed bookings only)
            $revenue = $this->bookingModel
                ->selectSum('total_price')
                ->where('payment_status', 'confirmed')
                ->first();
            $totalRevenue = $revenue['total_price'] ?? 0;

            // Total users
            $totalUsers = $this->userModel->where('role', 'user')->countAllResults();

            // Bookings by ticket type
            $bookingsByType = $this->bookingModel
                ->select('ticket_types.name, COUNT(bookings.id) as total_bookings, SUM(bookings.quantity) as total_tickets, SUM(bookings.total_price) as revenue')
                ->join('ticket_types', 'ticket_types.id = bookings.ticket_type_id')
                ->where('bookings.payment_status', 'confirmed')
                ->groupBy('bookings.ticket_type_id')
                ->findAll();

            // Recent bookings (last 5)
            $recentBookings = $this->bookingModel
                ->select('bookings.*, users.name as user_name, ticket_types.name as ticket_name')
                ->join('users', 'users.id = bookings.user_id')
                ->join('ticket_types', 'ticket_types.id = bookings.ticket_type_id')
                ->orderBy('bookings.created_at', 'DESC')
                ->limit(5)
                ->find();