app/Controllers/API/V1/Admin/PaymentVerification.php

    public function pending()
    {
        try {
            // Get all bookings with pending payment status
            $pendingBookings = $this->bookingModel
                ->select('bookings.*, users.name as user_name, users.email as user_email, ticket_types.name as ticket_name')
                ->join('users', 'users.id = bookings.user_id')
                ->join('ticket_types', 'ticket_types.id = bookings.ticket_type_id')
                ->where('bookings.payment_status', 'pending')
                ->orderBy('bookings.created_at', 'DESC')
                ->findAll();
---
SELECT `bookings`.*, `users`.`name` as `user_name`, `users`.`email` as `user_email`, `ticket_types`.`name` as `ticket_name`
FROM `bookings`
JOIN `users` ON `users`.`id` = `bookings`.`user_id`
JOIN `ticket_types` ON `ticket_types`.`id` = `bookings`.`ticket_type_id`
WHERE `bookings`.`payment_status` = 'pending'
ORDER BY `bookings`.`created_at` DESC

    public function approve($id = null)
    {
        if (!$id) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'ID booking harus disertakan',
                'data' => null,
            ])->setStatusCode(400);
        }

        try {
            $booking = $this->bookingModel->find($id);

            if (!$booking) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'Booking tidak ditemukan',
                    'data' => null,
                ])->setStatusCode(404);
            }

            // Generate QR Code
            $qrCodePath = $this->generateQRCode($booking);

            // Update payment status to confirmed and add QR code
            $updated = $this->bookingModel->update($id, [
                'payment_status' => 'confirmed',
                'qr_code' => $qrCodePath,
            ]);
---
SELECT *
FROM `bookings`
WHERE `bookings`.`id` = '8'
UPDATE `bookings` SET `payment_status` = 'confirmed', `qr_code` = 'uploads/qr_codes/MIRAI202511308285.png', `updated_at` = '2025-11-30 16:03:49'
WHERE `bookings`.`id` IN ('8')

            }

            // Get updated booking data with user and ticket info
            $updatedBooking = $this->bookingModel
                ->select('bookings.*, users.name as user_name, users.email as user_email, ticket_types.name as ticket_name')
                ->join('users', 'users.id = bookings.user_id')
                ->join('ticket_types', 'ticket_types.id = bookings.ticket_type_id')
                ->find($id);
---
SELECT `bookings`.*, `users`.`name` as `user_name`, `users`.`email` as `user_email`, `ticket_types`.`name` as `ticket_name`
FROM `bookings`
JOIN `users` ON `users`.`id` = `bookings`.`user_id`
JOIN `ticket_types` ON `ticket_types`.`id` = `bookings`.`ticket_type_id`
WHERE `bookings`.`id` = '8'

    private function generateQRCode($booking)
    {
        // Get ticket and user info
        $ticketModel = new \App\Models\TicketTypeModel();
        $userModel = new \App\Models\UserModel();

        $ticket = $ticketModel->find($booking['ticket_type_id']);
        $user = $userModel->find($booking['user_id']);
---
SELECT *
FROM `ticket_types`
WHERE `ticket_types`.`id` = '2'
SELECT *
FROM `users`
WHERE `users`.`id` = '3'