app/Controllers/API/V1/Admin/UserManagement.php

    public function index()
    {
        try {
            $page = $this->request->getGet('page') ?? 1;
            $perPage = $this->request->getGet('per_page') ?? 20;
            $search = $this->request->getGet('search') ?? '';

            $builder = $this->userModel->select('id, name, email, phone, role, created_at');

            if (!empty($search)) {
                $builder->like('name', $search)
                    ->orLike('email', $search);
            }

            $total = $builder->countAllResults(false);
            $users = $builder->paginate($perPage, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT `id`, `name`, `email`, `phone`, `role`, `created_at`
FROM `users`
 LIMIT 20

    public function delete($id = null)
    {
        if (!$id) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'ID user harus disertakan',
                'data' => null,
            ])->setStatusCode(400);
        }

        try {
            // Prevent deleting admin user
            $currentUserId = getCurrentUserId();
            if ($id == $currentUserId) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'Tidak dapat menghapus akun sendiri',
                    'data' => null,
                ])->setStatusCode(400);
            }

            $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

                ])->setStatusCode(404);
            }

            $deleted = $this->userModel->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('2')