app/Models/BookingModel.php

SELECT `bookings`.*, `ticket_types`.`name` as `ticket_name`, `ticket_types`.`description` as `ticket_description`
FROM `bookings`
JOIN `ticket_types` ON `ticket_types`.`id` = `bookings`.`ticket_type_id`
WHERE `bookings`.`user_id` = 3
ORDER BY `bookings`.`created_at` DESC
---
    public function getUserBookings(int $userId)
    {
        return $this->select('bookings.*, ticket_types.name as ticket_name, ticket_types.description as ticket_description')
            ->join('ticket_types', 'ticket_types.id = bookings.ticket_type_id')
            ->where('bookings.user_id', $userId)
            ->orderBy('bookings.created_at', 'DESC')
            ->findAll();

SELECT `bookings`.*, `ticket_types`.`name` as `ticket_name`, `ticket_types`.`description` as `ticket_description`, `users`.`name` as `user_name`, `users`.`email` as `user_email`
FROM `bookings`
JOIN `ticket_types` ON `ticket_types`.`id` = `bookings`.`ticket_type_id`
JOIN `users` ON `users`.`id` = `bookings`.`user_id`
WHERE `bookings`.`id` = 3
AND `bookings`.`user_id` = 2
 LIMIT 1
---
    public function getBookingDetail(int $bookingId, ?int $userId = null)
    {
        $builder = $this->select('bookings.*, ticket_types.name as ticket_name, ticket_types.description as ticket_description, users.name as user_name, users.email as user_email')
            ->join('ticket_types', 'ticket_types.id = bookings.ticket_type_id')
            ->join('users', 'users.id = bookings.user_id')
            ->where('bookings.id', $bookingId);

        if ($userId !== null) {
            $builder->where('bookings.user_id', $userId);
        }

        return $builder->first();

SELECT *
FROM `bookings`
WHERE `qr_code` = 'MF-1B4A4992B27492C0A8D4178DDBFFD4C7'
 LIMIT 1
---
    public function generateQRCode(): string
    {
        do {
            $qrCode = 'MF-' . strtoupper(bin2hex(random_bytes(16)));
        } while ($this->where('qr_code', $qrCode)->first());

SELECT *
FROM `bookings`
WHERE `booking_code` = 'MIRAI20251130BBB6'
 LIMIT 1
---
    public function generateBookingCode(): string
    {
        do {
            $bookingCode = 'MIRAI' . date('Ymd') . strtoupper(substr(bin2hex(random_bytes(3)), 0, 4));
        } while ($this->where('booking_code', $bookingCode)->first());

INSERT INTO `bookings` (`user_id`, `ticket_type_id`, `quantity`, `total_price`, `qr_code`, `booking_code`, `payment_status`, `created_at`, `updated_at`) VALUES (2, 2, 1, 350000, 'MF-1B4A4992B27492C0A8D4178DDBFFD4C7', 'MIRAI20251130BBB6', 'pending', '2025-11-30 15:16:08', '2025-11-30 15:16:08')
---
    public function createBooking(array $data): array
    {
        $data['qr_code'] = $this->generateQRCode();
        $data['booking_code'] = $this->generateBookingCode();
        $data['payment_status'] = 'pending';

        $inserted = $this->insert($data);