app/Models/TicketTypeModel.php

SELECT *
FROM `ticket_types`
WHERE `ticket_types`.`id` = 2
---
    public function checkAvailability(int $ticketTypeId, int $quantity): bool
    {
        $ticket = $this->find($ticketTypeId);

SELECT *
FROM `ticket_types`
WHERE `ticket_types`.`id` = 2
UPDATE `ticket_types` SET `remaining_quota` = 149, `updated_at` = '2025-11-30 15:16:08'
WHERE `ticket_types`.`id` IN (2)
---
    public function reduceQuota(int $ticketTypeId, int $quantity): bool
    {
        $ticket = $this->find($ticketTypeId);

        if (!$ticket) {
            return false;
        }

        $newQuota = $ticket['remaining_quota'] - $quantity;

        if ($newQuota < 0) {
            return false;
        }

        return $this->update($ticketTypeId, ['remaining_quota' => $newQuota]);