app/Models/UserModel.php

    public function verifyLogin(string $email, string $password)
    {
        $user = $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'aiman@gmail.com'
 LIMIT 1

    public function clearToken(int $userId)
    {
        return $this->update($userId, ['jwt_token' => null]);
---
UPDATE `users` SET `jwt_token` = NULL, `updated_at` = '2025-11-30 15:38:03'
WHERE `users`.`id` IN (2)

    public function isAdmin(int $userId): bool
    {
        $user = $this->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1